<?xml version="1.0" ?>
<net name="3class_540" version="10">
	<layers>
		<layer id="0" name="sub_2/negate_/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="mul/x/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="pad_to_bounding_box/sub/negate_/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="4" shape="1,1,3" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="ImageTensor" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,540,960"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="ImageTensor/Transpose/Cast_118937_const" type="Const" version="opset1">
			<data element_type="i64" offset="10" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="ImageTensor/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="42" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="pad_to_bounding_box/sub/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="pad_to_bounding_box/ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="42" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="pad_to_bounding_box/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="pad_to_bounding_box/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="42" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="pad_to_bounding_box/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Reshape/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="50" shape="1,1,3" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="pad_to_bounding_box/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="ExpandDims/dim/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="42" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="ExpandDims/Transpose/Cast_118957_const" type="Const" version="opset1">
			<data element_type="i64" offset="56" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>540</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="sub_2/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Mul1_/Fused_Mul_1197011972_const" type="Const" version="opset1">
			<data element_type="f16" offset="88" shape="16,3,3,3" size="864"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="MobilenetV3/Conv/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>540</dim>
					<dim>960</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_add_11051/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="952" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Add1_/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="MobilenetV3/Conv/hard_swish/add/y/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="MobilenetV3/Conv/hard_swish/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="MobilenetV3/Conv/hard_swish/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="MobilenetV3/Conv/hard_swish/mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="1854618549_const" type="Const" version="opset1">
			<data element_type="f16" offset="986" shape="16,1,1,3,3" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="MobilenetV3/expanded_conv/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_add_1105411059/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1274" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Add1_10004/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="MobilenetV3/expanded_conv/depthwise/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="MobilenetV3/expanded_conv/squeeze_excite/Mean/Cast_118947_const" type="Const" version="opset1">
			<data element_type="i64" offset="1306" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="MobilenetV3/expanded_conv/squeeze_excite/Mean" type="ReduceMean" version="opset1">
			<data keep_dims="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="MobilenetV3/expanded_conv/squeeze_excite/Conv/weights/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="1322" shape="8,16,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="MobilenetV3/expanded_conv/squeeze_excite/Conv/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="MobilenetV3/expanded_conv/squeeze_excite/Conv/biases/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1578" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="MobilenetV3/expanded_conv/squeeze_excite/Conv/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="MobilenetV3/expanded_conv/squeeze_excite/Conv/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="MobilenetV3/expanded_conv/squeeze_excite/Conv_1/weights/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="1594" shape="16,8,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_1106111063/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1850" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="MobilenetV3/expanded_conv/squeeze_excite/Conv_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="MobilenetV3/expanded_conv/squeeze_excite/Conv_1/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="MobilenetV3/expanded_conv/squeeze_excite/Conv_1/mul/y/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1882" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="MobilenetV3/expanded_conv/squeeze_excite/Conv_1/mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="MobilenetV3/expanded_conv/squeeze_excite/mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Mul1_10015/Fused_Mul_1197811980_const" type="Const" version="opset1">
			<data element_type="f16" offset="1884" shape="16,16,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="MobilenetV3/expanded_conv/project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="data_add_1106611071/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2396" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Add1_10016/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Mul1_10027/Fused_Mul_1198211984_const" type="Const" version="opset1">
			<data element_type="f16" offset="2428" shape="72,16,1,1" size="2304"/>
			<output>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="MobilenetV3/expanded_conv_1/expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="data_add_1107411079/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="4732" shape="1,72,1,1" size="144"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Add1_10028/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="MobilenetV3/expanded_conv_1/expand/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="1856218565_const" type="Const" version="opset1">
			<data element_type="f16" offset="4876" shape="72,1,1,3,3" size="1296"/>
			<output>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="MobilenetV3/expanded_conv_1/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="data_add_1108211087/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="6172" shape="1,72,1,1" size="144"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Add1_10040/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="MobilenetV3/expanded_conv_1/depthwise/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Mul1_10051/Fused_Mul_1199011992_const" type="Const" version="opset1">
			<data element_type="f16" offset="6316" shape="24,72,1,1" size="3456"/>
			<output>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="MobilenetV3/expanded_conv_1/project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="data_add_1109011095/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="9772" shape="1,24,1,1" size="48"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Add1_10052/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Mul1_10063/Fused_Mul_1199411996_const" type="Const" version="opset1">
			<data element_type="f16" offset="9820" shape="88,24,1,1" size="4224"/>
			<output>
				<port id="1" precision="FP16">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="MobilenetV3/expanded_conv_2/expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="data_add_1109811103/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="14044" shape="1,88,1,1" size="176"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Add1_10064/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="MobilenetV3/expanded_conv_2/expand/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="1853418537_const" type="Const" version="opset1">
			<data element_type="f16" offset="14220" shape="88,1,1,3,3" size="1584"/>
			<output>
				<port id="1" precision="FP16">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="MobilenetV3/expanded_conv_2/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="data_add_1110611111/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="15804" shape="1,88,1,1" size="176"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Add1_10076/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="MobilenetV3/expanded_conv_2/depthwise/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Mul1_10087/Fused_Mul_1200212004_const" type="Const" version="opset1">
			<data element_type="f16" offset="15980" shape="24,88,1,1" size="4224"/>
			<output>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="MobilenetV3/expanded_conv_2/project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="data_add_1111411119/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="20204" shape="1,24,1,1" size="48"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Add1_10088/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="MobilenetV3/expanded_conv_2/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Mul1_10099/Fused_Mul_1200612008_const" type="Const" version="opset1">
			<data element_type="f16" offset="20252" shape="96,24,1,1" size="4608"/>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="MobilenetV3/expanded_conv_3/expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="data_add_1112211127/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="24860" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Add1_10100/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="MobilenetV3/expanded_conv_3/expand/hard_swish/add/y/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="MobilenetV3/expanded_conv_3/expand/hard_swish/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="MobilenetV3/expanded_conv_3/expand/hard_swish/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="MobilenetV3/expanded_conv_3/expand/hard_swish/mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="1855018553_const" type="Const" version="opset1">
			<data element_type="f16" offset="25052" shape="96,1,1,5,5" size="4800"/>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="MobilenetV3/expanded_conv_3/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="data_add_1113011135/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="29852" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Add1_10112/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="MobilenetV3/expanded_conv_3/depthwise/hard_swish/add/y/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="MobilenetV3/expanded_conv_3/depthwise/hard_swish/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="MobilenetV3/expanded_conv_3/depthwise/hard_swish/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="MobilenetV3/expanded_conv_3/depthwise/hard_swish/mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="MobilenetV3/expanded_conv_3/depthwise/hard_swish/mul_1/y/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1882" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="MobilenetV3/expanded_conv_3/depthwise/hard_swish/mul_1" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="MobilenetV3/expanded_conv_3/squeeze_excite/Mean/Cast_118965_const" type="Const" version="opset1">
			<data element_type="i64" offset="1306" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="MobilenetV3/expanded_conv_3/squeeze_excite/Mean" type="ReduceMean" version="opset1">
			<data keep_dims="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="MobilenetV3/expanded_conv_3/squeeze_excite/Conv/weights/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="30044" shape="24,96,1,1" size="4608"/>
			<output>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="MobilenetV3/expanded_conv_3/squeeze_excite/Conv/biases/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="34652" shape="1,24,1,1" size="48"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="MobilenetV3/expanded_conv_3/squeeze_excite/Conv/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="MobilenetV3/expanded_conv_3/squeeze_excite/Conv/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/weights/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="34700" shape="96,24,1,1" size="4608"/>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="data_add_1113711139/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="39308" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/mul/y/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1882" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="MobilenetV3/expanded_conv_3/squeeze_excite/mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Mul1_10123/Fused_Mul_1201412016_const" type="Const" version="opset1">
			<data element_type="f16" offset="39500" shape="40,96,1,1" size="7680"/>
			<output>
				<port id="1" precision="FP16">
					<dim>40</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="MobilenetV3/expanded_conv_3/project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="data_add_1114211147/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="47180" shape="1,40,1,1" size="80"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Add1_10124/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Mul1_10135/Fused_Mul_1201812020_const" type="Const" version="opset1">
			<data element_type="f16" offset="47260" shape="240,40,1,1" size="19200"/>
			<output>
				<port id="1" precision="FP16">
					<dim>240</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
